### IF ELSE문 사용

In [1]:
import pandas as pd
import pymysql

In [2]:
conn1=pymysql.connect(host='127.0.0.1',user='root',password='1234',db='sqldb',charset='utf8')

In [3]:
cur_1=conn1.cursor()

In [4]:
sql="CALL ifelseProc('조용필');"

In [5]:
cur_1.execute(sql)
rows_1=cur_1.fetchall()
conn1.close()

In [6]:
pd_1=pd.DataFrame(rows_1)
pd_1

             0
0  나이가 지긋하시네요.

### CASE 문을 사용

In [7]:
import pandas as pd
import pymysql

In [8]:
conn1=pymysql.connect(host='127.0.0.1',user='root',password='1234',db='sqldb',charset='utf8')

In [9]:
cur_1=conn1.cursor()

In [10]:
sql="CALL caseProc('김범수');"

In [11]:
cur_1.execute(sql)
rows_1=cur_1.fetchall()
conn1.close()

In [12]:
pd_1=pd.DataFrame(rows_1)
pd_1

            0
0  김범수의 띠==>양

### while문 활용

In [14]:
import pandas as pd
import pymysql

In [15]:
conn1=pymysql.connect(host='127.0.0.1',user='root',password='1234',db='sqldb',charset='utf8')

In [16]:
cur_1=conn1.cursor()

In [17]:
sql="CALL whileProc();"
sql2="SELECT * FROM guguTBL;"

In [18]:
cur_1.execute(sql)
cur_1.execute(sql2)
rows_1=cur_1.fetchall()
conn1.close()

In [19]:
pd_1=pd.DataFrame(rows_1)
pd_1

                                                    0
0    2x1=2 2x2=4 2x3=6 2x4=8 2x5=10 2x6=12 2x7=14 ...
1    3x1=3 3x2=6 3x3=9 3x4=12 3x5=15 3x6=18 3x7=21...
2    4x1=4 4x2=8 4x3=12 4x4=16 4x5=20 4x6=24 4x7=2...
3    5x1=5 5x2=10 5x3=15 5x4=20 5x5=25 5x6=30 5x7=...
4    6x1=6 6x2=12 6x3=18 6x4=24 6x5=30 6x6=36 6x7=...
5    7x1=7 7x2=14 7x3=21 7x4=28 7x5=35 7x6=42 7x7=...
6    8x1=8 8x2=16 8x3=24 8x4=32 8x5=40 8x6=48 8x7=...
7    9x1=9 9x2=18 9x3=27 9x4=36 9x5=45 9x6=54 9x7=...
8    2x1=2 2x2=4 2x3=6 2x4=8 2x5=10 2x6=12 2x7=14 ...
9    3x1=3 3x2=6 3x3=9 3x4=12 3x5=15 3x6=18 3x7=21...
10   4x1=4 4x2=8 4x3=12 4x4=16 4x5=20 4x6=24 4x7=2...
11   5x1=5 5x2=10 5x3=15 5x4=20 5x5=25 5x6=30 5x7=...
12   6x1=6 6x2=12 6x3=18 6x4=24 6x5=30 6x6=36 6x7=...
13   7x1=7 7x2=14 7x3=21 7x4=28 7x5=35 7x6=42 7x7=...
14   8x1=8 8x2=16 8x3=24 8x4=32 8x5=40 8x6=48 8x7=...
15   9x1=9 9x2=18 9x3=27 9x4=36 9x5=45 9x6=54 9x7=...

### DECLARE HANDLER 이용해서 에러처리

In [20]:
import pandas as pd
import pymysql

In [21]:
conn1=pymysql.connect(host='127.0.0.1',user='root',password='1234',db='sqldb',charset='utf8')

In [22]:
cur_1=conn1.cursor()

In [23]:
sql="CALL errorProc();"

In [24]:
cur_1.execute(sql)
rows_1=cur_1.fetchall()
conn1.close()

In [25]:
pd_1=pd.DataFrame(rows_1)
pd_1

                              0
0  INT 오버플로 직접의 합계-->2147450880

### 현재 저장된 프로시저 이름과 내용 확인

In [26]:
import pandas as pd
import pymysql

In [27]:
conn1=pymysql.connect(host='127.0.0.1',user='root',password='1234',db='sqldb',charset='utf8')

In [28]:
cur_1=conn1.cursor()

In [29]:
sql="SELECT routine_name, routine_definition FROM INFORMATION_SCHEMA.ROUTINES WHERE routine_schema='sqldb' AND routine_type='PROCEDURE';"

In [30]:
cur_1.execute(sql)
rows_1=cur_1.fetchall()
conn1.close()

In [31]:
pd_1=pd.DataFrame(rows_1)
pd_1

            0                                                  1
0    caseProc  BEGIN\n\tDECLARE bYear INT;\n    DECLARE tti C...
1   errorProc  BEGIN\n    DECLARE i INT;\n    DECLARE hap INT...
2  ifelseProc  BEGIN\n\tDECLARE bYear INT;\n    SELECT birthY...
3    userProc                BEGIN\n\tSELECT *FROM userTbl;\nEND
4   userProc1  BEGIN\n\tSELECT *FROM userTbl WHERE name=userN...
5   userProc2  BEGIN\n\tSELECT *FROM userTbl \n    WHERE birt...
6   userProc3  BEGIN\n\tINSERT INTO testTBL VALUES(NULL,txtVa...
7   whileProc  BEGIN\n\tDECLARE str VARCHAR(100);\n    DECLAR...

### 파라미터 확인

In [32]:
import pandas as pd
import pymysql

In [33]:
conn1=pymysql.connect(host='127.0.0.1',user='root',password='1234',db='sqldb',charset='utf8')

In [34]:
cur_1=conn1.cursor()

In [35]:
sql="SELECT parameter_mode, parameter_name, dtd_identifier FROM INFORMATION_SCHEMA.PARAMETERS WHERE specific_name='userProc3';"

In [36]:
cur_1.execute(sql)
rows_1=cur_1.fetchall()
conn1.close()

In [37]:
pd_1=pd.DataFrame(rows_1)
pd_1

     0         1         2
0   IN  txtValue  char(10)
1  OUT  outValue       int

### SHOW CREATE PROCEDURE문으로 확인

In [38]:
import pandas as pd
import pymysql

In [39]:
conn1=pymysql.connect(host='127.0.0.1',user='root',password='1234',db='sqldb',charset='utf8')

In [40]:
cur_1=conn1.cursor()

In [41]:
sql="SHOW CREATE PROCEDURE sqldb.userProc3;"

In [42]:
cur_1.execute(sql)
rows_1=cur_1.fetchall()
conn1.close()

In [43]:
pd_1=pd.DataFrame(rows_1)
pd_1

,0,1,2,3,4,5
0,userProc3,"STRICT_TRANS_TABLES,NO_ENGINE_SUBSTITUTION",CREATE DEFINER=`root`@`localhost` PROCEDURE `u...,utf8mb4,utf8mb4_0900_ai_ci,utf8mb4_0900_ai_ci

### 직접 테이블 이름을 파라미터로 전달하는 방법

에러

### 동적 SQL

In [44]:
import pandas as pd
import pymysql

In [45]:
conn1=pymysql.connect(host='127.0.0.1',user='root',password='1234',db='sqldb',charset='utf8')

In [46]:
cur_1=conn1.cursor()

In [47]:
sql="CALL nameProc();"

In [48]:
cur_1.execute(sql)
rows_1=cur_1.fetchall()
conn1.close()

In [49]:
pd_1=pd.DataFrame(rows_1)
pd_1

     0    1     2   3     4        5    6           7
0  BBK  바비킴  1973  서울   010  0000000  176  2013-05-05
1  EJW  은지원  1972  경북   011  8888888  174  2014-03-03
2  JKW  조관우  1965  경기   018  9999999  172  2010-10-10
3  JYP  조용필  1950  경기   011  4444444  166  2009-04-04
4  KBS  김범수  1979  경남   011  2222222  173  2012-04-04
5  KKH  김경호  1971  전남   019  3333333  177  2007-07-07
6  LJB  임재범  1963  서울   016  6666666  182  2009-09-09
7  LSG  이승기  1987  서울   011  1111111  182  2008-08-08
8  SSK  성시경  1979  서울  None     None  186  2013-12-12
9  YJS  윤종신  1969  경남  None     None  170  2005-05-05